#!/usr/local/bin/python
# -*- coding: utf-8 -*-
from textblob import TextBlob
from fuzzywuzzy import fuzz
import nltk

#txt = u"మీరు ఎలా ఉన్నారు"
#txt=u"ఒకనొకప్పుడు , ఒక రాజుండేవాడు. ఆ రాజు కి ముగ్గురు పిల్లలు ఉండెవాలు. పెద్ధ రాజకుమరూడి పేరు  రాజేంద్ర. రెండవ రాజకుమరుడు  సూమెంద్ర మరియు మూడవ రాజకుమరుడు దేవేంద్ర. మూడు రాజకుమాతులు విద్య ముగిసిన తర్వత రాజధానికి తిరిగివచినప్పుడు రాజు కి అలూచన వచిచింది.  మూడు రాకుమారులలొ ఎవరు ఎక్కువ ప్రేమిస్తున్నరొ పరీక్షించడానికి నిర్ణయించుకున్నడు.ఆలోచన వచ్చిన వెంటనె రాజు ముగ్గురు  రాజకుమారులని పిలిచడు. రాజు అందరిని ఒక ప్రశ్న అడిగాడు."
#txt = "my name is alex"
#txt=u"అనగనగా ఒక అడవిలో ఒక కోతి, ఒక మొసలి స్నేహితులు. నీళ్ళల్లో ఉండే మొసలికి నేల మీద ఉండే కోతికి ఎలా పరిచయం అయ్యింది అంటారా? అది ఎవరికి తెలీదు. ఎలాగో పరిచయం అయ్యింది.కోతి ఇల్లు ఒక చెట్టు మీద ఉండేది. ఆ చెట్టు పక్కనే ఒక నది ఉండేందు. నదిలో మొసలి ఇల్లు. రోజు కోతి చెట్టు మీద, మొసలి నీళ్ళల్లో ఉంటూ నే కబుర్లు చెప్పుకుంటూ ఉండేవి. ఇద్దరి స్నేహం చూసి అడవిలో జంతువులూ ఆశ్చర్య పోయేవి. కోతికి అడవిలోని వేరే కోతులు మొసలిని నమ్మద్దని సలహా ఇచ్చేవి. మొసలి మాంసం తింటుంది, ఎప్పుడైనా నిన్ను కూడా తినేస్తుంది, అంటూ జాగ్రత్త పాడమని చెప్పేవి. కాని కోతికి మొసలి మీద నమ్మకం వుండేది. అందుకనే వాళ్ళ స్నేహం చాలా రోజులు కొనసాగింది."
#txt=u"ಆದಿಯಲ್ಲಿ ದೇವರು ಆಕಾಶವನ್ನೂ ಭೂಮಿಯನ್ನೂ ಸೃಷ್ಟಿಸಿದನು.ಭೂಮಿ ಯು ನಿರಾಕಾರವಾಗಿಯೂ ಶೂನ್ಯವಾಗಿಯೂ ಇತ್ತು; ಅಗಾಧದ ಮೇಲೆ ಕತ್ತಲೆ ಇತ್ತು. ದೇವರ ಆತ್ಮನು ನೀರುಗಳ ಮೇಲೆ ಚಲಿಸುತ್ತಿದ್ದನು.ಆಗ ದೇವರು--ಬೆಳಕಾಗಲಿ ಅನ್ನಲು ಬೆಳಕಾ ಯಿತು."
#txt1=u"ఆదియందు దేవుడు భూమ్యాకాశములను సృజించెను.భూమి నిరాకారముగాను శూన్యముగాను ఉండెను; చీకటి అగాధ జలము పైన కమ్మియుండెను; దేవుని ఆత్మ జలములపైన అల్లాడుచుండెను.దేవుడు వెలుగు కమ్మని  పలుకగా వెలుగు కలిగెను."
#t=open("kannada.txt","r")
#txt=t.readlines();
##t1=open("telugu.txt","r")
##txt1=t1.readlines();
##p=nltk.word_tokenize(txt[25].decode('utf-8'))
##p1=nltk.word_tokenize(txt1[25].decode('utf-8'))


#mapping words by traslating the text in kannada and telugu to english and them comparing
te_txt = u"ఆదియందు దేవుడు భూమ్యాకాశములను సృజించెను.భూమి నిరాకారముగాను శూన్యముగాను ఉండెను; చీకటి అగాధ జలము పైన కమ్మియుండెను; దేవుని ఆత్మ జలములపైన అల్లాడుచుండెను.దేవుడు వెలుగు కమ్మని  పలుకగా వెలుగు కలిగెను.వెలుగు మంచిదైనట్టు దేవుడుచూచెను; దేవుడు వెలుగును చీకటిని వేరుపరచెను.దేవుడు వెలుగునకు పగలనియు, చీకటికి రాత్రి అనియు పేరు పెట్టెను. అస్తమయమును ఉదయమును కలుగగా ఒక దినమాయెను.మరియు దేవుడుజలముల మధ్య నొక విశాలము కలిగి ఆ జలములను ఈ జలములను వేరుపరచును గాకని పలికెను.దేవుడు ఆ విశాలము చేసి విశాలము క్రింది జలములను విశాలము మీది జలములను వేరుపరపగా ఆ ప్రకారమాయెను.దేవుడు ఆ విశాలమునకు ఆకాశమని పేరు పెట్టెను. అస్తమయమును ఉదయమును కలుగగా రెండవ దినమాయెను.దేవుడుఆకాశము క్రిందనున్న జలము లొకచోటనే కూర్చబడి ఆరిన నేల కనబడును గాకని పలుకగా ఆ ప్రకారమాయెను.దేవుడు ఆరిన నేలకు భూమి అని పేరు పెట్టెను, జలరాశికి ఆయన సముద్రములని పేరు పెట్టెను, అది మంచిదని దేవుడు చూచెను.దేవుడుగడ్డిని విత్తనములిచ్చు చెట్లను భూమిమీద తమ తమ జాతి ప్రకారము తమలో విత్తనములుగల ఫలమిచ్చు ఫలవృక్షములను భూమి మొలిపించుగాకని పలుకగా ఆ ప్రకార మాయెను."
ka_txt = u"	ಆದಿಯಲ್ಲಿ ದೇವರು ಆಕಾಶವನ್ನೂ ಭೂಮಿಯನ್ನೂ ಸೃಷ್ಟಿಸಿದನು.ಭೂಮಿ ಯು ನಿರಾಕಾರವಾಗಿಯೂ ಶೂನ್ಯವಾಗಿಯೂ ಇತ್ತು; ಅಗಾಧದ ಮೇಲೆ ಕತ್ತಲೆ ಇತ್ತು. ದೇವರ ಆತ್ಮನು ನೀರುಗಳ ಮೇಲೆ ಚಲಿಸುತ್ತಿದ್ದನು.ಆಗ ದೇವರು--ಬೆಳಕಾಗಲಿ ಅನ್ನಲು ಬೆಳಕಾ ಯಿತು.ದೇವರು ಬೆಳಕನ್ನು ಒಳ್ಳೆಯದೆಂದು ನೋಡಿದನು; ದೇವರು ಬೆಳಕನ್ನು ಕತ್ತಲೆಯಿಂದ ಬೇರೆ ಮಾಡಿದನು.ದೇವರು ಬೆಳಕಿಗೆ ಹಗ ಲೆಂದೂ ಕತ್ತಲೆಗೆ ರಾತ್ರಿಯೆಂದೂ ಕರೆದನು. ಹೀಗೆ ಸಾಯಂಕಾಲವೂ ಪ್ರಾತಃಕಾಲವೂ ಆಗಿ ಮೊದಲನೆಯ ದಿನವಾಯಿತು.ಇದಲ್ಲದೆ ದೇವರು--ನೀರುಗಳ ನಡುವೆ ವಿಶಾಲ ವಿರಲಿ ಮತ್ತು ಅದು ನೀರುಗಳಿಂದ ನೀರುಗಳನ್ನು ಬೇರೆ ಮಾಡಲಿ ಅಂದನು.ದೇವರು ವಿಶಾಲವನ್ನು ಮಾಡಿ ವಿಶಾಲದ ಕೆಳಗಿದ್ದ ನೀರುಗಳನ್ನು ವಿಶಾಲದ ಮೇಲಿದ್ದ ನೀರುಗಳಿಂದ ಬೇರೆ ಮಾಡಿದನು. ಅದು ಹಾಗೆಯೇ ಆಯಿತು.ದೇವರು ವಿಶಾಲಕ್ಕೆ ಆಕಾಶ ವೆಂದು ಕರೆದನು. ಹೀಗೆ ಸಾಯಂಕಾಲವೂ ಪ್ರಾತಃ ಕಾಲವೂ ಆಗಿ ಎರಡನೆಯ ದಿನವಾಯಿತು.ಆಗ ದೇವರು--ಆಕಾಶದ ಕೆಳಗಿರುವ ನೀರುಗಳು ಒಂದು ಸ್ಥಳದಲ್ಲಿ ಕೂಡಿಕೊಳ್ಳಲಿ ಮತ್ತು ಒಣನೆಲವು ಕಾಣಿಸಲಿ ಅಂದನು. ಅದು ಹಾಗೆಯೇ ಆಯಿತು.ದೇವರು ಒಣನೆಲಕ್ಕೆ ಭೂಮಿಯೆಂದೂ ಒಟ್ಟು ಗೂಡಿದ ನೀರುಗಳಿಗೆ ಸಮುದ್ರಗಳೆಂದೂ ಕರೆದನು. ದೇವರು ಅದನ್ನು ಒಳ್ಳೆಯದೆಂದು ನೋಡಿದನು.ತರುವಾಯ ದೇವರು--ಭೂಮಿಯು ಹುಲ್ಲನ್ನೂ ಬೀಜಕೊಡುವ ಪಲ್ಯವನ್ನೂ ತನ್ನೊಳಗೆ ಬೀಜವಿದ್ದು ತನ್ನ ಜಾತಿಯ ಪ್ರಕಾರ ಫಲಫಲಿಸುವ ಹಣ್ಣಿನ ಮರವನ್ನೂ ಭೂಮಿಯ ಮೇಲೆ ಮೊಳೆಯಿಸಲಿ ಎಂದು ಹೇಳಿದನು; ಅದು ಹಾಗೆಯೇ ಆಯಿತು."
te_txt_blob = TextBlob(te_txt)
ka_txt_blob = TextBlob(ka_txt)
print ka_txt_blob.detect_language()
ka_to_eng=ka_txt_blob.translate(to='en')
print te_txt_blob.detect_language()
te_to_eng=te_txt_blob.translate(to='en')
print fuzz.ratio(ka_to_eng, te_to_eng)
