#!/usr/bin/env python
#coding: utf-8
from __future__ import print_function
import nltk
#import nltk.corpus.indian


a = s.split()


text = nltk.word_tokenize(s1.decode('utf-8'))
#print(text)
text1 = nltk.word_tokenize(s2.decode('utf-8'))


s3="అవును"
s5="భారతదేశం నా దేశం. అన్ని భారతీయులు నా సోదరులు మరియు సోదరీమణులు"
s6="ಭಾರತದ ನನ್ನ ದೇಶ. ಎಲ್ಲಾ ಇಂಡಿಯನ್ಸ್ ನನ್ನ ಸಹೋದರರು ಮತ್ತು ಸಹೋದರಿಯರು"
s7="ఒకప్పుడు ఒక రాజుండేవాడు. ఆ రాజుకి 3 పిల్లలు ఉండెవాలు. పెద్ధ రాజకుమరూడి పేరు  రాజేంద్ర. రెండవ రాజకుమరుడు  సూమెంద్ర మరియు మూడవ రాజకుమరుడు దేవేంద్ర. మూడు రాజకుమాతులు విద్య ముగిసిన తర్వత రాజధానికి తిరిగివచినప్పుడు రాజు కి అలూచన వచిచింది.  మూడు రాకుమారులలొ ఎవరు ఎక్కువ ప్రేమిస్తున్నరొ పరీక్షించడానికి నిర్ణయించుకున్నడు.ఆలోచన వచ్చిన వెంటనె రాజు ముగ్గురు  రాజకుమారులని పిలిచడు. రాజు అందరిని ఒక ప్రశ్న అడిగాడు.  మరుసటి రోజు, పెద్ధ రాజకుమరుడు రాజేంద్ర వచ్చి, రాజు తొ  నెను నాణెం, సంపదలకన్న  రాజుని ఎక్కువ  ప్రేమిస్తున్నాను. రాజు సంతోషించాడు.  రెండవ రాజకుమారుడు సూమెంద్ర వచ్చి,  నేను కజ్జికాయ కన్న  రాజుని ఎక్కువ  ప్రేమిస్తున్నాను. రాజు సంతోషించాడు.  మూడవ రాజకుమరుడు దెవెంద్ర వచ్చి,  నెను ఉప్పు కన్న రాజుని ఎక్కువ  ప్రేమిస్తున్నాను. రాజు కొపంగ ఉన్నడు. నన్ను కనిష్త ఉప్పంత ప్రీతి అని చెప్థవ(హె గొత్ అంగ్ర్య్ అబౌత్ థె ఫచ్త్ థత్ దెవెన్ లొవెస్ హిం అస్ ముచ్ అస్ మెరె సల్త్).రాజుకి కొపం వచి దెవెంద్రని తిడుతు నువ్వు నన్ను ప్రెమించకపొతె అప్పుడు నీకు నా రజ్య సంపద పైన హక్కు లెధు.ఇది చెప్పిన తర్వత దెవెంద్ర ని రజ్యం వదిలి వెల్లమన్నడు."
s8="ಒಂದಾನೊಂದು ಕಾಲದಲ್ಲಿ ಒಬ್ಬ ರಾಜನಿದ್ದ. ಆ ರಾಜನಿಗೆ 3 ಜನ ಮಕ್ಕಳು. ಹಿರಿಯ ರಾಜಕುಮಾರನ ಹೆಸರು ರಾಜೇಂದ್ರ. ಎರಡನೇ ರಾಜಕುಮಾರ ಸೋಮೆಂದ್ರ. ಹಾಗೂ ಮೂರನೇ ರಾಜಕುಮಾರ ದೇವೇಂದ್ರ. ಮೂವರೂ ರಾಜಕುಮಾರರೂ ವಿದ್ಯಾರ್ಜನೆ ಮುಗಿಸಿ ರಾಜಧಾನಿಗೆ ಹಿಂದಿರುಗಿದ ಮೇಲೆ ರಾಜನಿಗೆ ಒಂದು ಯೋಚನೆ ಬಂತು. ಮೂರು ಜನ ರಾಜಕುಮಾರರಲ್ಲಿ ಯಾರು ತನ್ನನ್ನು ಹೆಚ್ಚು ಪ್ರೀತಿಸುತ್ತಾರೆ ಎಂದು ಪರೀಕ್ಷಿಸಲು ನಿರ್ಧರಿಸಿದ. ಆ ಯೋಚನೆ ಬಂದ ಕೂಡಲೇ ರಾಜ ಮೂವರೂ ರಾಜಕುಮಾರರನ್ನು ಕರೆಸಿದ. ಅವರೆಲ್ಲರಿಗೆ ಒಂದು ಪ್ರಶ್ನೆ ಹಾಕಿದ . ಅದೇನೆಂದರೆ ರಾಜನನ್ನು ಅವರು ಎಷ್ಟು ಪ್ರೀತಿಸುತ್ತಾರೆ ಎಂಬ ಪ್ರಶ್ನೆ ಹಾಕಿ ಮಾರನೇ ದಿನ ಉತ್ತರಿಸಲು ಹೇಳಿದ. ಮರುದಿನ ಹಿರಿಯ ರಾಜಕುಮಾರ ರಾಜೇಂದ್ರ ಬಂದು ತಾನು ರಾಜನನ್ನು ನಗ, ನಾಣ್ಯ, ಸಂಪತ್ತು ಎಲ್ಲವುಗಳಿಗಿಂತ ಹೆಚ್ಚಾಗಿ ಪ್ರೀತಿಸುತ್ತೇನೆಂದು ಹೇಳಿದ. ರಾಜನಿಗೆ ಸಂತೋಷವಾಯಿತು. ಎರಡನೇ ರಾಜಕುಮಾರ ಸೋಮೆಂದ್ರ ಬಂದು ತಾನು ರಾಜನನ್ನು ಎಲ್ಲಾ ಸಿಹಿತಿಂಡಿಗಳು ಕಜ್ಜಾಯಗಳಿಗಿಂತ ತುಂಬಾ ಹೆಚ್ಚಾಗಿ ಪ್ರೀತಿಸುತ್ತೇನೆಂದು ಹೇಳಿದ. ರಾಜನಿಗೆ ಕುಶಿಯಾಯಿತು. ಮೂರನೇ ರಾಜಕುಮಾರ ದೇವೇಂದ್ರ ಬಂದು ತಾನು ರಾಜನನ್ನು ಉಪ್ಪಿಗಿಂತ ಹೆಚ್ಚಾಗಿ ಪ್ರೀತಿಸುತ್ತೇನೆಂದು ಹೇಳಿದ. ರಾಜನಿಗೆ ತುಂಬಾ ಕೋಪ ಬಂತು. ತನ್ನನ್ನು ಆ ಕನಿಷ್ಠ ಉಪ್ಪಿಗಿಂತ ಪ್ರೀತಿಸುತ್ತಾನೆಂದು ಹೇಳುತ್ತಾನಲ್ಲ ದೇವೇಂದ್ರ ಎಂದು. ರಾಜ ಕೋಪದಿಂದ ದೇವೇಂದ್ರನಿಗೆ ಬೈದು ತನ್ನನ್ನು ಪ್ರೀತಿಸದ ಮೇಲೆ ತನ್ನ ರಾಜ್ಯ ಸಂಪತ್ತು ಯಾವೂದರಲ್ಲೂ ನಿನಗೆ ಹಕ್ಕಿಲ್ಲ ಎಂದು ಹೇಳಿ ದೇವೇಂದ್ರನನ್ನು ರಾಜ್ಯದಿಂದ ಹೊರಕ್ಕೆ ಹಾಕಿಬಿಟ್ಟ."
s9="ఒకనొకప్పుడు , ఒక రాజుండేవాడు. ఆ రాజు కి ముగ్గురు పిల్లలు ఉండెవాలు. పెద్ధ రాజకుమరూడి పేరు  రాజేంద్ర. రెండవ రాజకుమరుడు  సూమెంద్ర మరియు మూడవ రాజకుమరుడు దేవేంద్ర. మూడు రాజకుమాతులు విద్య ముగిసిన తర్వత రాజధానికి తిరిగివచినప్పుడు రాజు కి అలూచన వచిచింది"
s10="ಒಂದಾನೊಂದು ಕಾಲದಲ್ಲಿ ಒಬ್ಬ ರಾಜನಿದ್ದ. ಆ ರಾಜನಿಗೆ 3 ಜನ ಮಕ್ಕಳು. ಹಿರಿಯ ರಾಜಕುಮಾರನ ಹೆಸರು ರಾಜೇಂದ್ರ. ಎರಡನೇ ರಾಜಕುಮಾರ ಸೋಮೆಂದ್ರ. ಹಾಗೂ ಮೂರನೇ ರಾಜಕುಮಾರ ದೇವೇಂದ್ರ. ಮೂವರೂ ರಾಜಕುಮಾರರೂ ವಿದ್ಯಾರ್ಜನೆ ಮುಗಿಸಿ ರಾಜಧಾನಿಗೆ ಹಿಂದಿರುಗಿದ ಮೇಲೆ ರಾಜನಿಗೆ ಒಂದು ಯೋಚನೆ ಬಂತು"
s11="డబ్బు మీరు విషయాలు కొనుగోలు ఉపయోగించేది. మీరు, గృహ కోర్స్ టు పూర్తి మీ భత్యం కోసం, లేదా పంటి కోల్పోయినందుకు, మంచి తరగతులు పొందడానికి నుండి డబ్బు పొందగలుగుతారు! మనీ మన ప్రపంచంలో చాలా ముఖ్యం మరియు అనేక రూపాలలో లభిస్తుంది."
s12="ಮನಿ ನೀವು ವಸ್ತುಗಳನ್ನು ಖರೀದಿಸಲು ಬಳಸಲು ಏನು. ನೀವು ಮನೆಕೆಲಸಗಳನ್ನು ಮುಗಿದ, ನಿಮ್ಮ ಭತ್ಯೆ, ಅಥವಾ ಹಲ್ಲಿನ ಸೋತ ಒಳ್ಳೆಯದು ಶ್ರೇಣಿಗಳನ್ನು ಪಡೆಯುವಲ್ಲಿ ಹಣ ಗಳಿಸಲು ಮಾಡಬಹುದು! ಮನಿ ನಮ್ಮ ವಿಶ್ವದ ಬಹಳ ಮುಖ್ಯ ಮತ್ತು ಅನೇಕ ವಿವಿಧ ರೂಪಗಳಲ್ಲಿ ಬರುತ್ತದೆ"
s13="ఆకుపచ్చ ఒక అందమైన రంగు ఉంది! ప్రకృతిలో, మీరు నడిచే ఆ గడ్డి ఆకుపచ్చ మరియు మీరు చెట్లకు చూసే ఆకులు సాధారణంగా ఆకుపచ్చ ఉన్నాయి. మీరు చూసే మొక్కలు చాలా చాలా, ఆకుపచ్చ ఉన్నాయి! కప్పలు ఆకుపచ్చ మరియు అనేక గొల్లభామలు చాలా, ఆకుపచ్చ ఉన్నాయి. తాబేళ్లు ఆకుపచ్చ వివిధ షేడ్స్ ఉన్నాయి."
s14="ಹಸಿರು ಒಂದು ಸುಂದರ ಬಣ್ಣವಾಗಿದೆ! ಪ್ರಕೃತಿ, ನೀವು ನಡೆದಾಡಿದ ಆ ಹುಲ್ಲಿನ ಹಸಿರು ಮತ್ತು ನೀವು ಮರಗಳಲ್ಲಿ ನೋಡಿ ಎಲೆಗಳು ಸಾಮಾನ್ಯವಾಗಿ ಹಸಿರು. ನೀವು ನೋಡಿ ಸಸ್ಯಗಳ ಅತ್ಯಂತ ತುಂಬಾ, ಹಸಿರು! ಕಪ್ಪೆಗಳು ಹಸಿರು ಮತ್ತು ಅನೇಕ ಕುಪ್ಪಳಿಸುವ ತುಂಬಾ, ಹಸಿರು. ಟರ್ಟಲ್ಸ್ ಹಸಿರು ವಿವಿಧ ಛಾಯೆಗಳು ಅವು."

f1=open('telugu.txt','r')
f2=open('kannada.txt','r')
s1w=f1.readlines()

txt="ఆదియందు దేవుడు భూమ్యాకాశములను సృజించెను.భూమి నిరాకారముగాను శూన్యముగాను ఉండెను; చీకటి అగాధ జలము పైన కమ్మియుండెను; దేవుని ఆత్మ జలములపైన అల్లాడుచుండెను.దేవుడు వెలుగు కమ్మని  పలుకగా వెలుగు కలిగెను.వెలుగు మంచిదైనట్టు దేవుడుచూచెను; దేవుడు వెలుగును చీకటిని వేరుపరచెను.దేవుడు వెలుగునకు పగలనియు, చీకటికి రాత్రి అనియు పేరు పెట్టెను. అస్తమయమును ఉదయమును కలుగగా ఒక దినమాయెను.మరియు దేవుడుజలముల మధ్య నొక విశాలము కలిగి ఆ జలములను ఈ జలములను వేరుపరచును గాకని పలికెను.దేవుడు ఆ విశాలము చేసి విశాలము క్రింది జలములను విశాలము మీది జలములను వేరుపరపగా ఆ ప్రకారమాయెను.దేవుడు ఆ విశాలమునకు ఆకాశమని పేరు పెట్టెను. అస్తమయమును ఉదయమును కలుగగా రెండవ దినమాయెను.దేవుడుఆకాశము క్రిందనున్న జలము లొకచోటనే కూర్చబడి ఆరిన నేల కనబడును గాకని పలుకగా ఆ ప్రకారమాయెను.దేవుడు ఆరిన నేలకు భూమి అని పేరు పెట్టెను, జలరాశికి ఆయన సముద్రములని పేరు పెట్టెను, అది మంచిదని దేవుడు చూచెను.దేవుడుగడ్డిని విత్తనములిచ్చు చెట్లను భూమిమీద తమ తమ జాతి ప్రకారము తమలో విత్తనములుగల ఫలమిచ్చు ఫలవృక్షములను భూమి మొలిపించుగాకని పలుకగా ఆ ప్రకార మాయెను."
txt1="ಆದಿಯಲ್ಲಿ ದೇವರು ಆಕಾಶವನ್ನೂ ಭೂಮಿಯನ್ನೂ ಸೃಷ್ಟಿಸಿದನು.ಭೂಮಿ ಯು ನಿರಾಕಾರವಾಗಿಯೂ ಶೂನ್ಯವಾಗಿಯೂ ಇತ್ತು; ಅಗಾಧದ ಮೇಲೆ ಕತ್ತಲೆ ಇತ್ತು. ದೇವರ ಆತ್ಮನು ನೀರುಗಳ ಮೇಲೆ ಚಲಿಸುತ್ತಿದ್ದನು.ಆಗ ದೇವರು--ಬೆಳಕಾಗಲಿ ಅನ್ನಲು ಬೆಳಕಾ ಯಿತು.ದೇವರು ಬೆಳಕನ್ನು ಒಳ್ಳೆಯದೆಂದು ನೋಡಿದನು; ದೇವರು ಬೆಳಕನ್ನು ಕತ್ತಲೆಯಿಂದ ಬೇರೆ ಮಾಡಿದನು.ದೇವರು ಬೆಳಕಿಗೆ ಹಗ ಲೆಂದೂ ಕತ್ತಲೆಗೆ ರಾತ್ರಿಯೆಂದೂ ಕರೆದನು. ಹೀಗೆ ಸಾಯಂಕಾಲವೂ ಪ್ರಾತಃಕಾಲವೂ ಆಗಿ ಮೊದಲನೆಯ ದಿನವಾಯಿತು.ಇದಲ್ಲದೆ ದೇವರು--ನೀರುಗಳ ನಡುವೆ ವಿಶಾಲ ವಿರಲಿ ಮತ್ತು ಅದು ನೀರುಗಳಿಂದ ನೀರುಗಳನ್ನು ಬೇರೆ ಮಾಡಲಿ ಅಂದನು.ದೇವರು ವಿಶಾಲವನ್ನು ಮಾಡಿ ವಿಶಾಲದ ಕೆಳಗಿದ್ದ ನೀರುಗಳನ್ನು ವಿಶಾಲದ ಮೇಲಿದ್ದ ನೀರುಗಳಿಂದ ಬೇರೆ ಮಾಡಿದನು. ಅದು ಹಾಗೆಯೇ ಆಯಿತು.ದೇವರು ವಿಶಾಲಕ್ಕೆ ಆಕಾಶ ವೆಂದು ಕರೆದನು. ಹೀಗೆ ಸಾಯಂಕಾಲವೂ ಪ್ರಾತಃ ಕಾಲವೂ ಆಗಿ ಎರಡನೆಯ ದಿನವಾಯಿತು.ಆಗ ದೇವರು--ಆಕಾಶದ ಕೆಳಗಿರುವ ನೀರುಗಳು ಒಂದು ಸ್ಥಳದಲ್ಲಿ ಕೂಡಿಕೊಳ್ಳಲಿ ಮತ್ತು ಒಣನೆಲವು ಕಾಣಿಸಲಿ ಅಂದನು. ಅದು ಹಾಗೆಯೇ ಆಯಿತು.ದೇವರು ಒಣನೆಲಕ್ಕೆ ಭೂಮಿಯೆಂದೂ ಒಟ್ಟು ಗೂಡಿದ ನೀರುಗಳಿಗೆ ಸಮುದ್ರಗಳೆಂದೂ ಕರೆದನು. ದೇವರು ಅದನ್ನು ಒಳ್ಳೆಯದೆಂದು ನೋಡಿದನು.ತರುವಾಯ ದೇವರು--ಭೂಮಿಯು ಹುಲ್ಲನ್ನೂ ಬೀಜಕೊಡುವ ಪಲ್ಯವನ್ನೂ ತನ್ನೊಳಗೆ ಬೀಜವಿದ್ದು ತನ್ನ ಜಾತಿಯ ಪ್ರಕಾರ ಫಲಫಲಿಸುವ ಹಣ್ಣಿನ ಮರವನ್ನೂ ಭೂಮಿಯ ಮೇಲೆ ಮೊಳೆಯಿಸಲಿ ಎಂದು ಹೇಳಿದನು; ಅದು ಹಾಗೆಯೇ ಆಯಿತು."
s15="ఎమిలీ 8 సంవత్సరాల నాటిది. ఆమె ఒక పెద్ద ఇంటిలో నివసిస్తున్నాడు. ఆమె భారీ గది ఉంది. ఆమె అనేక బొమ్మలు ఉంది మరియు ఆమె స్నేహితులు చాలా ఉంది. కానీ ఎమిలీ నచ్చలేదు. ఆమె ఒక రహస్య ఉంది."
s16="ಎಮಿಲಿ 8 ವರ್ಷ ವಯಸ್ಸು. ಅವರು ಒಂದು ದೊಡ್ಡ ಮನೆಯಲ್ಲಿ ವಾಸಿಸುತ್ತಾನೆ. ಅವರು ಒಂದು ದೊಡ್ಡ ಕೊಠಡಿ ಹೊಂದಿದೆ. ಅವರು ಅನೇಕ ಆಟಿಕೆಗಳಿವೆ ಮತ್ತು ಅವರು ಸ್ನೇಹಿತರು ಬಹಳಷ್ಟು ಹೊಂದಿದೆ. ಆದರೆ ಎಮಿಲಿ ಸಂತೋಷ ಅಲ್ಲ. ಅವರು ರಹಸ್ಯ ಹೊಂದಿದೆ."
#s1w=f1.readlines()

s1x=f2.readlines()
##t=min(len(s5),len(s6))

r=(nltk.word_tokenize(s1w[0].decode('utf-8')))
#print(r)
s4="ಅವುನು"
#r1=s8.strip();
r1=(nltk.word_tokenize(s1x[0].decode('utf-8')))
#print(r1)
u=len(s13.split())
v=len(s14.split())
w=min(u,v)
d={}
c=0
d={u'\u0c08': u'\u0c88', u'\u0c0c': u'\u0c8c', u'\u0c10': u'\u0c90', u'\u0c14': u'\u0c94', u'\u0c18': u'\u0c98', u'\u0c1c': u'\u0c9c', u'\u0c20': u'\u0ca0', u'\u0c24': u'\u0ca4', u'\u0c28': u'\u0ca8', u'\u0c2c': u'\u0cac', u'\u0c30': u'\u0cb0', u'\u0c34': u'\u0cb4', u'\u0c38': u'\u0cb8', u'\u0c3c': u'\u0cbc', u'\u0c40': u'\u0cc0', u'\u0c44': u'\u0cc4', u'\u0c48': u'\u0cc8', u'\u0c4c': u'\u0ccc', u'\u0c58': u'\u0cde', u'\u0c60': u'\u0ce0', u'\u0c68': u'\u0ce8', u'\u0c07': u'\u0c87', u'\u0c0b': u'\u0c8b', u'\u0c0f': u'\u0c8f', u'\u0c13': u'\u0c93', u'\u0c17': u'\u0c97', u'\u0c1b': u'\u0c9b', u'\u0c1f': u'\u0c9f', u'\u0c23': u'\u0ca3', u'\u0c27': u'\u0ca7', u'\u0c2b': u'\u0cab', u'\u0c2f': u'\u0caf', u'\u0c33': u'\u0cb3', u'\u0c37': u'\u0cb7', u'\u0c3b': u'\u0cbb', u'\u0c3f': u'\u0cbf', u'\u0c43': u'\u0cc3', u'\u0c47': u'\u0cc7', u'\u0c4b': u'\u0ccb', u'\u0c4f': u'\u0ccf', u'\u0c63': u'\u0ce3', u'\u0c67': u'\u0ce7', u'\u0c6b': u'\u0ceb', u'\u0c6f': u'\u0cef', u'\u0c06': u'\u0c86', u'\u0c0a': u'\u0c8a', u'\u0c0e': u'\u0c8e', u'\u0c12': u'\u0c92', u'\u0c16': u'\u0c96', u'\u0c1a': u'\u0c9a', u'\u0c1e': u'\u0c9e', u'\u0c22': u'\u0ca2', u'\u0c26': u'\u0ca6', u'\u0c2a': u'\u0caa', u'\u0c2e': u'\u0cae', u'\u0c32': u'\u0cb2', u'\u0c36': u'\u0cb6', u'\u0c3a': u'\u0cba', u'\u0c3e': u'\u0cbe', u'\u0c42': u'\u0cc2', u'\u0c46': u'\u0cc6', u'\u0c4a': u'\u0cca', u'\u0c4e': u'\u0cce', u'\u0c56': u'\u0cd6', u'\u0c5a': u'\u0cde', u'\u0c62': u'\u0ce2', u'\u0c66': u'\u0ce6', u'\u0c6a': u'\u0cea', u'\u0c6e': u'\u0cee', u'\u0c05': u'\u0c85', u'\u0c0d': u'\u0c8d', u'\u0c11': u'\u0c91', u'\u0c15': u'\u0c95', u'\u0c1d': u'\u0c9d', u'\u0c21': u'\u0ca1', u'\u0c25': u'\u0ca5', u'\u0c2d': u'\u0cad', u'\u0c31': u'\u0cb1', u'\u0c35': u'\u0cb5', u'\u0c39': u'\u0cb9', u'\u0c3d': u'\u0cbd', u'\u0c41': u'\u0cc1', u'\u0c45': u'\u0cc5', u'\u0c4d': u'\u0ccd', u'\u0c55': u'\u0cd5', u'\u0c59': u'\u0cde', u'\u0c61': u'\u0ce1', u'\u0c69': u'\u0ce9'}
x=0
if len(r)<len(r1):
    x=len(r)
elif len(r)==len(r1):
    x=len(r)
else:
    x=len(r1)
#print(x)  
di={}
tel=[]
kan=[]
for j in range(len(r)):
    for k in range(len(r1)):
       # print(r[j],"**",r1[j])
        e=min(len(r[j]),len(r1[k]))
        #print(e)
        for i in range(e):
            if r[j][i] in d:
                if d[r[j][i]]==r1[k][i]:
               # print(r[j][i])
                #print(r1[j][i])
                     c+=1
        #print(r[j],r1[k])
          # di[r[j]]=r1[j
       # print(c,"^^^",e)
        if(c>=(e)/2):
            if r[j] not in tel:
                tel.append(r[j])
                #print(r[j])
            if r1[k] not in kan:
                kan.append(r1[k])
                #print(r1[k])
            print(r[j],r1[k])
        c=0
                
        


##result = nltk.pos_tag(tel)
##m=0
##o=0
##do={}
##
##result1 = nltk.pos_tag(r1)
##res1=nltk.pos_tag(r)
##for val in res1:
##    do[list(val)[0].encode('utf-8')]=list(val)[1]
##    print (list(val)[0].encode('utf-8'), list(val)[1])
##print("***************************************************")
##
##for v in result1:
##    #print(val)
##        #if((list(val)[0])in tel) and (list(v)[0] in kan):
####        if(tel.index(list(val)[0]) == kan.index(list(v)[0])):
####                print (list(v)[0].encode('utf-8'), list(val)[1])
####        else:
##        print (list(v)[0].encode('utf-8'),list(v)[1] )
##print("***************************************************")
##for val in result:
##    print (list(val)[0].encode('utf-8'), list(val)[1])
##print("***************************************************")
##res = nltk.pos_tag(kan)
##for v in res:
##    print (list(v)[0].encode('utf-8'),list(v)[1] )
##for val in result1:
##    if (list(val)[0]) in kan:
##        print (list(val)[0].encode('utf-8'), list(val)[1])
##    else:
##        print (list(val)[0].encode('utf-8'), 'XX')
##        o+=1
##    m+=1
    
##    print (list(val)[0].encode('utf-8'), list(val)[1])
                          

